'number' + 3 + 3 // 1. 'number' - це стрінга, тому 3 теж перетворюється на стрінгу. Буде 'number3'. 
// 2. 'number3' - це строка, тому наступна 3ка теж стає стрінгою
console.log('number' + 3 + 3); //'number33'

null + 3 // null перетворюється на 0, тому 0 + 3 = 3
console.log(null +3); // 3

5 && "qwerty" // && повертає друге значення, якщл перше true. 5 - true
console.log(5 && "qwerty"); //'qwerty'

+'40' + +'2' + "hillel"; // + перетворює стрінгу на число (40 та 2). 40+2 =42 
// додаємо стрінгу "hillel" (42 перетворюється на стрінгу)
console.log(+'40' + +'2' + "hillel"); //'42hillel'

'10' - 5 === 6; //10 перетворюється на число. 10-5 = 5. 5 не дорівнює 6
console.log('10' - 5 === 6); //false

true + false //перетворюється на числа: true = 1, false = 0. 1+0 = 1
console.log(true + false); // 1

'4px' - 3 // '4px' це стрінга з буквами, вона не перетвориться на число. Тому відняти від слова 3 ми не можемо
console.log('4px' - 3); //NaN

'4' - 3 // а тут 4 може перетвориться на 4. Тому буде 4-3
console.log('4' - 3); // 1 

'6' + 3 ** 0; //**має вищий приоритет, тому спочатку 3 ** 0 = 1 */
// далі '6' + 1. 6 це стрінга, тому 1 теж перетворюється на стрінгу
console.log('6' + 3 ** 0); // '61'

12 / '6' // стрінга '6' перетворюється на число, тому 12/6 = 2
console.log(12 / '6'); // 2

'10' + (5 === 6); //спочатку виконуємо дію у скобках: 5 не дорівнює 6, тому false
// далі стрінгу '10' додаємо до false. false теж стає стрінгою
console.log('10' + (5 === 6)); // '10false'

null == '' // null це false, пуста стрінга це теж false. Але null дорівнює тількі undefined
console.log(null == '' ); //false

3 ** (9 / 3); //спочатку дія у скобках 9 / 3 = 3
// виходить 3 ** 3 = 27
console.log(3 ** (9 / 3)); // 27

!!'false' == !!'true' //за допомогою ! стрінги перетворюється та інвертує на буліан значення (false), а другий ! ще раз інвертує (true)
//true == true
console.log(!!'false' == !!'true'); // true

0 || '0' && 1 //спочатку вирішуємо '0' && 1: '0' - це true, тому '0' && 1 повертає друге значення 1
// виходить  0 || 1. Так як 0 це false, то повертається друге значення 1
console.log(0 || '0' && 1 ); // 1

(+null == false) < 1; // унарний плюс перетворює null на цифру 0
// 0 == false. == це нестрога рівність, тому false перетворюється на 0
// 0 == 0. Це true
// true < 1. true перетворюється на 1. 1<1
console.log((+null == false) < 1); // false

false && true || true //спочатку вирішуємо false && true: так як перше значення false, то далі не смотримо. Відповідь false
// тепер false || true. Якщо перше значення false, то повертається друге значення - true
console.log(false && true || true); // true

false && (false || true); //спочатку вірішуємо значення у скобках false || true = true
// виходить false && true. Відповіль false
console.log(false && (false || true)); // false

(+null == false) < 1 ** 5; // сточатку дія у скобках +null == false. +null це 0. 0 == false. false - це 0. тому відповіль у рівнянні true
//далі приоритет у 1 ** 5. Відповідь 1
// виходить true < 1. True це 1, тому 1 < 1. Відповідь false
console.log((+null == false) < 1 ** 5); // false